clojure-collections-comparison.org
#+OPTIONS: toc:nil
#+EXPORT_FILE_NAME: index.html
#+HTML_HEAD: <style type="text/css">body{ max-width:50%; }</style> 
#+COLUMNS: %28ITEM(item) %25LIST(list) %28VECTOR(vector) %24HASH-SET(hash-set) %26SORTED-SET(sorted-set) %34HASH-MAP(hash-map) %37SORTED-MAP(sorted-map)


https://github.com/slk500/clojure-collections-comparison is open for MR.

legend:
- '1' means minimal data provided e.g (list 1), (vector 1), (hash-map :a 1)
- 'coll' is one of data type: list, vector, hash-set, sorted-set, hash-map. Because everyone of them is a collection. 

#+BEGIN: columnview :hlines 1 :id global
| item                       | list                     | vector                      | hash-set                 | sorted-set                 | hash-map                           | sorted-map                           |
|----------------------------+--------------------------+-----------------------------+--------------------------+----------------------------+------------------------------------+--------------------------------------|
| "literal syntax"           | ()                       | [ ]                         | #{}                      | #{}                        | {}                                 | {}                                   |
|----------------------------+--------------------------+-----------------------------+--------------------------+----------------------------+------------------------------------+--------------------------------------|
| create from args           | (list 1 2 3)             | (vector 1 2 3)              | (hash-set 2 3 1)         | (sorted-set 1 2 3)         | (hash-map :b 2 :c 3 :a 1)          | (sorted-map :a 1 :b 2 :c 3)          |
|----------------------------+--------------------------+-----------------------------+--------------------------+----------------------------+------------------------------------+--------------------------------------|
| create from collection     | (apply list [1 2 3])     | (vec '(1 2 3))              | (set '(2 3 1))           | (apply sorted-set [2 3 1]) | (into (hash-map) {:a 1 :b 2 :c 3}) | (into (sorted-map) {:a 1 :b 2 :c 3}) |
|----------------------------+--------------------------+-----------------------------+--------------------------+----------------------------+------------------------------------+--------------------------------------|
| (coll? coll)               | true                     | true                        | true                     | true                       | true                               | true                                 |
|----------------------------+--------------------------+-----------------------------+--------------------------+----------------------------+------------------------------------+--------------------------------------|
| (sequential? coll)         | true                     | true                        | false                    | false                      | false                              | false                                |
|----------------------------+--------------------------+-----------------------------+--------------------------+----------------------------+------------------------------------+--------------------------------------|
| (associative? coll)        | false                    | true                        | false                    | false                      | true                               | true                                 |
|----------------------------+--------------------------+-----------------------------+--------------------------+----------------------------+------------------------------------+--------------------------------------|
| (type coll)                | PersistentList$EmptyList | PersistentVector            | PersistentHashSet        | PersistentTreeSet          | PersistentArrayMap                 | PersistentTreeMap                    |
|----------------------------+--------------------------+-----------------------------+--------------------------+----------------------------+------------------------------------+--------------------------------------|
| (type (coll 1))            | PersistentList           | PersistentVector            | PersistentHashSet        | PersistentTreeSet          | PersistentArrayMap                 | PersistentTreeMap                    |
|----------------------------+--------------------------+-----------------------------+--------------------------+----------------------------+------------------------------------+--------------------------------------|
| (list? coll)               | true                     | false                       | false                    | false                      | false                              | false                                |
|----------------------------+--------------------------+-----------------------------+--------------------------+----------------------------+------------------------------------+--------------------------------------|
| (vector? coll)             | false                    | true                        | false                    | false                      | false                              | false                                |
|----------------------------+--------------------------+-----------------------------+--------------------------+----------------------------+------------------------------------+--------------------------------------|
| (set? coll)                | false                    | false                       | true                     | true                       | false                              | false                                |
|----------------------------+--------------------------+-----------------------------+--------------------------+----------------------------+------------------------------------+--------------------------------------|
| (map? coll)                | false                    | false                       | false                    | false                      | true                               | true                                 |
|----------------------------+--------------------------+-----------------------------+--------------------------+----------------------------+------------------------------------+--------------------------------------|
| (seq? coll)                | true                     | false                       | false                    | false                      | false                              | false                                |
|----------------------------+--------------------------+-----------------------------+--------------------------+----------------------------+------------------------------------+--------------------------------------|
| (seq? (coll 1))            | true                     | false                       | false                    | false                      | false                              | false                                |
|----------------------------+--------------------------+-----------------------------+--------------------------+----------------------------+------------------------------------+--------------------------------------|
| (seq? (seq coll))          | false                    | false                       | false                    | false                      | false                              | false                                |
|----------------------------+--------------------------+-----------------------------+--------------------------+----------------------------+------------------------------------+--------------------------------------|
| (seq? (seq (coll 1))       | true                     | true                        | true                     | true                       | true                               | true                                 |
|----------------------------+--------------------------+-----------------------------+--------------------------+----------------------------+------------------------------------+--------------------------------------|
| (type (seq coll))          | nil                      | nil                         | nil                      | nil                        | nil                                | nil                                  |
|----------------------------+--------------------------+-----------------------------+--------------------------+----------------------------+------------------------------------+--------------------------------------|
| (type (sequence coll)      | PersistentList$EmptyList | PersistentList$EmptyList    | PersistentList$EmptyList | PersistentList$EmptyList   | PersistentList$EmptyList           | PersistentList$EmptyList             |
|----------------------------+--------------------------+-----------------------------+--------------------------+----------------------------+------------------------------------+--------------------------------------|
| (type (sequence (coll 1))) | PersistentList           | PersistentVector$ChunkedSeq | APersistentMap$KeySeq    | APersistentMap$KeySeq      | PersistentHashMap$NodeSeq          | PersistentTreeMap$Seq                |
|----------------------------+--------------------------+-----------------------------+--------------------------+----------------------------+------------------------------------+--------------------------------------|
| (type (seq (coll 1)))      | PersistentList           | PersistentVector$ChunkedSeq | APersistentMap$KeySeq    | APersistentMap$KeySeq      | PersistentHashMap$NodeSeq          | PersistentTreeMap$Seq                |
|----------------------------+--------------------------+-----------------------------+--------------------------+----------------------------+------------------------------------+--------------------------------------|
| "unique elements"          | false                    | false                       | true                     | true                       | true (only keys)                   | true (only keys)                     |
|----------------------------+--------------------------+-----------------------------+--------------------------+----------------------------+------------------------------------+--------------------------------------|
| "same order of elements"   | true                     | true                        | false                    | true                       | false                              | true                                 |
|----------------------------+--------------------------+-----------------------------+--------------------------+----------------------------+------------------------------------+--------------------------------------|
| "read"                     | nth                      | get, IFn, nth               |                          |                            | get, IFn, key                      | get, IFn, key                        |
|----------------------------+--------------------------+-----------------------------+--------------------------+----------------------------+------------------------------------+--------------------------------------|
| (get coll 1)               | nil                      | nil                         | nil                      | nil                        | nil                                | nil                                  |
|----------------------------+--------------------------+-----------------------------+--------------------------+----------------------------+------------------------------------+--------------------------------------|
| (get (coll 1) 1)           | nil                      | true (index)                | useless                  | useless                    | true (key)                         | true (key)                           |
|----------------------------+--------------------------+-----------------------------+--------------------------+----------------------------+------------------------------------+--------------------------------------|
| (get nil 1)                | nil                      | nil                         | nil                      | nil                        | nil                                | nil                                  |
|----------------------------+--------------------------+-----------------------------+--------------------------+----------------------------+------------------------------------+--------------------------------------|
| "get out of range"         | nil or not-found         | nil or not-found            | nil or not-found         | nil or not-found           | nil or not-found                   | nil or not-found                     |
|----------------------------+--------------------------+-----------------------------+--------------------------+----------------------------+------------------------------------+--------------------------------------|
| "IFn"                      | error                    | ([:a :b :c] 1) => :b        | error                    | error                      | ({:b 2 :c 3 :a 1} :b) => 2         | ({:a 1 :b 2 :c 3} :a) => 1           |
|----------------------------+--------------------------+-----------------------------+--------------------------+----------------------------+------------------------------------+--------------------------------------|
| "IFn out of range"         | error                    | error                       | error                    | error                      | nil                                | nil                                  |
|----------------------------+--------------------------+-----------------------------+--------------------------+----------------------------+------------------------------------+--------------------------------------|
| "nth"                      | true                     | true                        | true                     | true                       | error                              | error                                |
|----------------------------+--------------------------+-----------------------------+--------------------------+----------------------------+------------------------------------+--------------------------------------|
| (nth nil 1)                |                          | nil                         |                          |                            |                                    |                                      |
|----------------------------+--------------------------+-----------------------------+--------------------------+----------------------------+------------------------------------+--------------------------------------|
| "nth out of range"         |                          |                             |                          |                            |                                    |                                      |
|----------------------------+--------------------------+-----------------------------+--------------------------+----------------------------+------------------------------------+--------------------------------------|
| "add"                      | cons, conj               |                             |                          |                            | assoc                              | assoc                                |
|----------------------------+--------------------------+-----------------------------+--------------------------+----------------------------+------------------------------------+--------------------------------------|
| "conj (coll)"              | front                    | back                        | vary                     | vary                       | vary                               | vary                                 |
|----------------------------+--------------------------+-----------------------------+--------------------------+----------------------------+------------------------------------+--------------------------------------|
| "cons (seq)"               | front                    | front                       | vary                     | vary                       | vary                               | vary                                 |
|----------------------------+--------------------------+-----------------------------+--------------------------+----------------------------+------------------------------------+--------------------------------------|
| "remove"                   |                          | disj                        |                          |                            | dissoc                             |                                      |
|----------------------------+--------------------------+-----------------------------+--------------------------+----------------------------+------------------------------------+--------------------------------------|
| "contains?"                | error                    | true (index)                | true (element)           | true (element)             | true (key)                         | true (key)                           |
#+END:

