index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-05-02 Tue 20:23 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="Sławomir Grochowski" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<p>
legend:
</p>
<ul class="org-ul">
<li>'data' means minimal data provided e.g (list 1), (vector 1), (hash-map :a 1)</li>
</ul>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">item</th>
<th scope="col" class="org-left">list</th>
<th scope="col" class="org-left">vector</th>
<th scope="col" class="org-left">hash-set</th>
<th scope="col" class="org-left">sorted-set</th>
<th scope="col" class="org-left">hash-map</th>
<th scope="col" class="org-left">sorted-map</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">"literal syntax"</td>
<td class="org-left">()</td>
<td class="org-left">[ ]</td>
<td class="org-left">#{}</td>
<td class="org-left">#{}</td>
<td class="org-left">{}</td>
<td class="org-left">{}</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">create from args</td>
<td class="org-left">(list 1 2 3)</td>
<td class="org-left">(vector 1 2 3)</td>
<td class="org-left">(hash-set 2 3 1)</td>
<td class="org-left">(sorted-set 1 2 3)</td>
<td class="org-left">(hash-map :b 2 :c 3 :a 1)</td>
<td class="org-left">(sorted-map :a 1 :b 2 :c 3)</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">create from collection</td>
<td class="org-left">?</td>
<td class="org-left">(vec '(1 2 3))</td>
<td class="org-left">(set '(2 3 1))</td>
<td class="org-left">?</td>
<td class="org-left">?</td>
<td class="org-left">(into (sorted-map) {:a 1 :b 2 :c 3})</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">coll?</td>
<td class="org-left">[X]</td>
<td class="org-left">[X]</td>
<td class="org-left">[X]</td>
<td class="org-left">[X]</td>
<td class="org-left">[X]</td>
<td class="org-left">[X]</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">sequential?</td>
<td class="org-left">[X]</td>
<td class="org-left">[X]</td>
<td class="org-left">[ ]</td>
<td class="org-left">[ ]</td>
<td class="org-left">[ ]</td>
<td class="org-left">[ ]</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">associative?</td>
<td class="org-left">[ ]</td>
<td class="org-left">[X]</td>
<td class="org-left">[ ]</td>
<td class="org-left">[ ]</td>
<td class="org-left">[X]</td>
<td class="org-left">[X]</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">type</td>
<td class="org-left">PersistentList$EmptyList</td>
<td class="org-left">PersistentVector</td>
<td class="org-left">PersistentHashSet</td>
<td class="org-left">PersistentTreeSet</td>
<td class="org-left">PersistentArrayMap</td>
<td class="org-left">PersistentTreeMap</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">type data</td>
<td class="org-left">PersistentList</td>
<td class="org-left">PersistentVector</td>
<td class="org-left">PersistentHashSet</td>
<td class="org-left">PersistentTreeSet</td>
<td class="org-left">PersistentArrayMap</td>
<td class="org-left">PersistentTreeMap</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">list?</td>
<td class="org-left">[X]</td>
<td class="org-left">[ ]</td>
<td class="org-left">[ ]</td>
<td class="org-left">[ ]</td>
<td class="org-left">[ ]</td>
<td class="org-left">[ ]</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">vector?</td>
<td class="org-left">[ ]</td>
<td class="org-left">[X]</td>
<td class="org-left">[ ]</td>
<td class="org-left">[ ]</td>
<td class="org-left">[ ]</td>
<td class="org-left">[ ]</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">set?</td>
<td class="org-left">[ ]</td>
<td class="org-left">[ ]</td>
<td class="org-left">[X]</td>
<td class="org-left">[X]</td>
<td class="org-left">[ ]</td>
<td class="org-left">[ ]</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">map?</td>
<td class="org-left">[ ]</td>
<td class="org-left">[ ]</td>
<td class="org-left">[ ]</td>
<td class="org-left">[ ]</td>
<td class="org-left">[X]</td>
<td class="org-left">[X]</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">seq?</td>
<td class="org-left">[X]</td>
<td class="org-left">[ ]</td>
<td class="org-left">[ ]</td>
<td class="org-left">[ ]</td>
<td class="org-left">[ ]</td>
<td class="org-left">[ ]</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">seq? data</td>
<td class="org-left">[X]</td>
<td class="org-left">[ ]</td>
<td class="org-left">[ ]</td>
<td class="org-left">[ ]</td>
<td class="org-left">[ ]</td>
<td class="org-left">[ ]</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">seq? seq</td>
<td class="org-left">[ ]</td>
<td class="org-left">[ ]</td>
<td class="org-left">[ ]</td>
<td class="org-left">[ ]</td>
<td class="org-left">[ ]</td>
<td class="org-left">[ ]</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">seq? seq data</td>
<td class="org-left">[X]</td>
<td class="org-left">[X]</td>
<td class="org-left">[X]</td>
<td class="org-left">[X]</td>
<td class="org-left">[X]</td>
<td class="org-left">[X]</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">type seq</td>
<td class="org-left">nil</td>
<td class="org-left">nil</td>
<td class="org-left">nil</td>
<td class="org-left">nil</td>
<td class="org-left">nil</td>
<td class="org-left">nil</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">type sequence</td>
<td class="org-left">PersistentList$EmptyList</td>
<td class="org-left">PersistentList$EmptyList</td>
<td class="org-left">PersistentList$EmptyList</td>
<td class="org-left">PersistentList$EmptyList</td>
<td class="org-left">PersistentList$EmptyList</td>
<td class="org-left">PersistentList$EmptyList</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">type seq data</td>
<td class="org-left">PersistentList</td>
<td class="org-left">PersistentVector$ChunkedSeq</td>
<td class="org-left">APersistentMap$KeySeq</td>
<td class="org-left">APersistentMap$KeySeq</td>
<td class="org-left">PersistentHashMap$NodeSeq</td>
<td class="org-left">PersistentTreeMap$Seq</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">type sequence data</td>
<td class="org-left">PersistentList</td>
<td class="org-left">PersistentVector$ChunkedSeq</td>
<td class="org-left">APersistentMap$KeySeq</td>
<td class="org-left">APersistentMap$KeySeq</td>
<td class="org-left">PersistentHashMap$NodeSeq</td>
<td class="org-left">PersistentTreeMap$Seq</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">"unique elements"</td>
<td class="org-left">[ ]</td>
<td class="org-left">[ ]</td>
<td class="org-left">[X]</td>
<td class="org-left">[X]</td>
<td class="org-left">[X] only keys</td>
<td class="org-left">[X] only keys</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">"same order of elements"</td>
<td class="org-left">[X]</td>
<td class="org-left">[X]</td>
<td class="org-left">[ ]</td>
<td class="org-left">[X]</td>
<td class="org-left">[ ]</td>
<td class="org-left">[X]</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">"read"</td>
<td class="org-left">nth</td>
<td class="org-left">get, IFn, nth</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">get, IFn, key</td>
<td class="org-left">get, IFn, key</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">get</td>
<td class="org-left">nil</td>
<td class="org-left">nil</td>
<td class="org-left">nil</td>
<td class="org-left">nil</td>
<td class="org-left">nil</td>
<td class="org-left">nil</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">get data</td>
<td class="org-left">nil</td>
<td class="org-left">[X] index</td>
<td class="org-left">useless</td>
<td class="org-left">useless</td>
<td class="org-left">[X] key</td>
<td class="org-left">[X] key</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">get nil</td>
<td class="org-left">nil</td>
<td class="org-left">nil</td>
<td class="org-left">nil</td>
<td class="org-left">nil</td>
<td class="org-left">nil</td>
<td class="org-left">nil</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">get out of range</td>
<td class="org-left">nil or not-found</td>
<td class="org-left">nil or not-found</td>
<td class="org-left">nil or not-found</td>
<td class="org-left">nil or not-found</td>
<td class="org-left">nil or not-found</td>
<td class="org-left">nil or not-found</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">IFn</td>
<td class="org-left">error</td>
<td class="org-left">([:a :b :c] 1) =&gt; :b</td>
<td class="org-left">error</td>
<td class="org-left">error</td>
<td class="org-left">({:b 2 :c 3 :a 1} :b) =&gt; 2</td>
<td class="org-left">({:a 1 :b 2 :c 3} :a) =&gt; 1</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">IFn out of range</td>
<td class="org-left">error</td>
<td class="org-left">error</td>
<td class="org-left">error</td>
<td class="org-left">error</td>
<td class="org-left">nil</td>
<td class="org-left">nil</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">nth</td>
<td class="org-left">[X]</td>
<td class="org-left">[X]</td>
<td class="org-left">[X]</td>
<td class="org-left">{X]</td>
<td class="org-left">error</td>
<td class="org-left">error</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">nth nil</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">nil</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">nth out of range</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">"add"</td>
<td class="org-left">cons, conj</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">assoc</td>
<td class="org-left">assoc</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">conj (coll)</td>
<td class="org-left">front</td>
<td class="org-left">back</td>
<td class="org-left">vary</td>
<td class="org-left">vary</td>
<td class="org-left">vary</td>
<td class="org-left">vary</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">cons (seq)</td>
<td class="org-left">front</td>
<td class="org-left">front</td>
<td class="org-left">vary</td>
<td class="org-left">vary</td>
<td class="org-left">vary</td>
<td class="org-left">vary</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">"remove"</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">disj</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">dissoc</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">contains?</td>
<td class="org-left">error</td>
<td class="org-left">[X] index</td>
<td class="org-left">[X] element</td>
<td class="org-left">[X] element</td>
<td class="org-left">[X] key</td>
<td class="org-left">[X] key</td>
</tr>
</tbody>
</table>
