clojure-collections-comparison.org
* "literal syntax"
:PROPERTIES:
 :list: ()
 :vector: [ ]
 :HASH-SET: #{}
 :sorted-set: #{}
 :hash-map: {}
 :sorted-map: {}
:END:

#+begin_src clojure
  (type '()) ;=> PersistentList$EmptyList
#+end_src
       
* create from args
:PROPERTIES:
 :list: (list 1 2 3)
 :vector: (vector 1 2 3)
 :hash-set: (hash-set 2 3 1)
 :sorted-set: (sorted-set 1 2 3)
 :hash-map: (hash-map :b 2 :c 3 :a 1)
 :sorted-map: (sorted-map :a 1 :b 2 :c 3)
:END:
* create from collection
:PROPERTIES:
:LIST:     (apply list [1 2 3])
 :vector: (vec '(1 2 3))
 :hash-set: (set '(2 3 1))
 :SORTED-SET: (apply sorted-set [2 3 1])
 :HASH-MAP: (into (hash-map) {:a 1 :b 2 :c 3})
 :sorted-map: (into (sorted-map) {:a 1 :b 2 :c 3})
:END:

#+begin_src clojure
(apply list [1 2 3]) ;=> (1 2 3)
(apply sorted-set [2 3 1]) ;=> #{1 2 3}
(into (hash-map) {:a 1 :b 2}) ;=> {:a 1, :b 2}
(into (sorted-map) {:b 2 :c 3 :a 1}) ;=> {:a 1, :b 2, :c 3}
#+end_src

* (coll? coll)
:PROPERTIES:
 :list: true
 :vector: true
 :HASH-SET: true
 :sorted-set: true
 :hash-map: true
 :sorted-map: true
:END:

#+begin_src clojure
(coll? (list)) ; => true
(coll? (vector))  ; => true
(coll? (hash-set)) ; => true
(coll? (sorted-set))  ; => true
(coll? (hash-map)) ; => true
(coll? (sorted-map))  ; => true
#+end_src

* (sequential? coll)
:PROPERTIES:
 :list: true
 :vector: true
 :HASH-SET: false
 :SORTED-SET: false
 :HASH-MAP: false
 :SORTED-MAP: false
:END:
Returns true if coll implements Sequential

Definitions from Oxford Languages: sequential - forming or following in a logical order or sequence.
#+begin_src clojure
(sequential? (list)) ;=> true
(sequential? (vector)) ;=> true
(sequential? (hash-set)) ;=> false
(sequential? (sorted-set)) ;=> false
(sequential? (hash-map)) ;=> false
(sequential? (sorted-map)) ;=> false
#+end_src

I was thinking that sorted-set & sorted-map are (= sequential? true)
They have logical order (they are sorted) so why they are not sequential?

dgb23
hashed collections have sequence representations (map entries) that are sequential.
I think it is more of an implementation thing. In theory you're right, they are both sequential and hashed collections.

phill
The sequential? docstring tells me nothing about what it does! I do not see a basis for expectation of any particular return value. It would be a good question for ask.clojure.org so it might get clarified.
However, it would be normal for sequential? to mean "preserves the order of insertion?" which vectors do (expect true), lists do in reverse (expect -true), and sets and maps never do (expect false). (edited)

dgb23
Sequential is an empty interface. I think it's just a signal that is put on certain implementations.
* (associative? coll)
:PROPERTIES:
 :list: false
 :vector: true
 :HASH-SET: false
 :sorted-set: false
 :hash-map: true
 :sorted-map: true
:END:
Returns true if coll implements Associative
#+begin_src clojure
(associative? (list)) ;=> false
(associative? (vector)) ;=> true
(associative? (hash-set)) ;=> false
(associative? (sorted-set)) ;=> false
(associative? (hash-map)) ;=> true
(associative? (sorted-map)) ;=> true
#+end_src
* (type coll)
:PROPERTIES:
 :list: PersistentList$EmptyList
 :vector: PersistentVector
 :hash-set: PersistentHashSet
 :sorted-set: PersistentTreeSet
 :hash-map: PersistentArrayMap
 :sorted-map: PersistentTreeMap
:END:
Returns the :type metadata of x, or its Class if none
#+begin_src clojure
(type (list)) ;=> Persistentlist$EmptyList
(type (vector)) ;=> PersistentVector
(type (hash-set)) ;=> PersistentHashSet
(type (sorted-set)) ;=> PersistentTreeSet
(type (hash-map)) ;=> PersistentArrayMap
(type (sorted-map)) ;=> PersistentTreeMap
#+end_src
* (type (coll 1))
:PROPERTIES:
:list:     PersistentList
 :vector: PersistentVector
 :hash-set: PersistentHashSet
 :sorted-set: PersistentTreeSet
 :hash-map: PersistentArrayMap
 :sorted-map: PersistentTreeMap
:END:

#+begin_src clojure
(type (list 1)) ;=> Persistentlist
(type (vector 1)) ;=> PersistentVector
(type (hash-set 1)) ;=> PersistentHashSet
(type (sorted-set 1)) ;=> PersistentTreeSet
(type (hash-map :a 1)) ;=> PersistentHashMap
(type (sorted-map :a 1)) ;=> PersistentTreeMap
#+end_src
* (list? coll)
:PROPERTIES:
 :list: true
 :vector: false
 :HASH-SET: false
 :sorted-set: false
 :hash-map: false
 :sorted-map: false
:END:
Returns true if x implements IPersistentlist
#+begin_src clojure
(list? (list)) ;=> true
(list? (vector)) ;=> false
(list? (hash-set)) ;=> false
(list? (sorted-set)) ;=> false
(list? (hash-map)) ;=> false
(list? (sorted-map)) ;=> false
#+end_src
       
* (vector? coll)
:PROPERTIES:
 :list: false
 :vector: true
 :HASH-SET: false
 :sorted-set: false
 :hash-map: false
 :sorted-map: false
:END:
Return true if x implements IPersistentVector
#+begin_src clojure
(vector? (list)) ;=> false
(vector? (vector)) ;=> true
(vector? (hash-set)) ;=> false
(vector? (sorted-set)) ;=> false
(vector? (hash-map)) ;=> false
(vector? (sorted-map)) ;=> false
#+end_src
* (set? coll)
:PROPERTIES:
 :list: false
 :vector: false
 :HASH-SET: true
 :sorted-set: true
 :hash-map: false
 :sorted-map: false
:END:

#+begin_src clojure
  (set? (list)) ;=> false
  (set? (vector)) ;=> false
  (set? (hash-set)) ;=> true
  (set? (sorted-set)) ;=> true
  (set? (hash-map)) ;=> false
  (set? (sorted-map)) ;=> false
#+end_src
* (map? coll)
:PROPERTIES:
 :list: false
 :vector: false
 :HASH-SET: false
 :sorted-set: false
 :hash-map: true
 :sorted-map: true
:END:

#+begin_src clojure
  (map? (list)) ;=> false
  (map? (vector)) ;=> false
  (map? (hash-set)) ;=> false
  (map? (sorted-set)) ;=> false
  (map? (hash-map)) ;=> true
  (map? (sorted-map)) ;=> true
#+end_src
* (seq? coll)
:PROPERTIES:
 :list: true
 :vector: false
 :HASH-SET: false
 :sorted-set: false
 :hash-map: false
 :sorted-map: false
:END:
Return true if x implements ISeq

#+begin_src clojure
  (seq? (list)) ;=> true
  (seq? (vector)) ;=> false
  (seq? (hash-set)) ;=> false
  (seq? (sorted-set)) ;=> false
  (seq? (hash-map)) ;=> false
  (seq? (sorted-map)) ;=> false
#+end_src
