index.html

<div id="outline-container-orgf79af3a" class="outline-2">
<h2 id="orgf79af3a"><span class="section-number-2">1.</span> "literal syntax"</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">
<pre class="src src-clojure">(type '()) <span style="color: #696969;">;=&gt; PersistentList$EmptyList</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org6ba893d" class="outline-2">
<h2 id="org6ba893d"><span class="section-number-2">2.</span> create from args</h2>
<div class="outline-text-2" id="text-2">
</div>
</div>
<div id="outline-container-org3cc3974" class="outline-2">
<h2 id="org3cc3974"><span class="section-number-2">3.</span> create from collection</h2>
<div class="outline-text-2" id="text-3">
</div>
</div>
<div id="outline-container-org2a575fc" class="outline-2">
<h2 id="org2a575fc"><span class="section-number-2">4.</span> coll?</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">
<pre class="src src-clojure">(coll? (list)) <span style="color: #696969;">; =&gt; true</span>
(coll? (vector))  <span style="color: #696969;">; =&gt; true</span>
(coll? (hash-set)) <span style="color: #696969;">; =&gt; true</span>
(coll? (sorted-set))  <span style="color: #696969;">; =&gt; true</span>
(coll? (hash-map)) <span style="color: #696969;">; =&gt; true</span>
(coll? (sorted-map))  <span style="color: #696969;">; =&gt; true</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org8069934" class="outline-2">
<h2 id="org8069934"><span class="section-number-2">5.</span> sequential?</h2>
<div class="outline-text-2" id="text-5">
<p>
Returns true if coll implements Sequential
</p>

<p>
Definitions from Oxford Languages: sequential - forming or following in a logical order or sequence.
</p>
<div class="org-src-container">
<pre class="src src-clojure">(sequential? (list)) <span style="color: #696969;">;=&gt; true</span>
(sequential? (vector)) <span style="color: #696969;">;=&gt; true</span>
(sequential? (hash-set)) <span style="color: #696969;">;=&gt; false</span>
(sequential? (sorted-set)) <span style="color: #696969;">;=&gt; false</span>
(sequential? (hash-map)) <span style="color: #696969;">;=&gt; false</span>
(sequential? (sorted-map)) <span style="color: #696969;">;=&gt; false</span>
</pre>
</div>

<p>
I was thinking that sorted-set &amp; sorted-map are (= sequential? true)
They have logical order (they are sorted) so why they are not sequential?
</p>

<p>
dgb23
hashed collections have sequence representations (map entries) that are sequential.
I think it is more of an implementation thing. In theory you're right, they are both sequential and hashed collections.
</p>

<p>
phill
The sequential? docstring tells me nothing about what it does! I do not see a basis for expectation of any particular return value. It would be a good question for ask.clojure.org so it might get clarified.
However, it would be normal for sequential? to mean "preserves the order of insertion?" which vectors do (expect true), lists do in reverse (expect -true), and sets and maps never do (expect false). (edited)
</p>

<p>
dgb23
Sequential is an empty interface. I think it's just a signal that is put on certain implementations.
</p>
</div>
</div>
<div id="outline-container-org6c56a91" class="outline-2">
<h2 id="org6c56a91"><span class="section-number-2">6.</span> associative?</h2>
<div class="outline-text-2" id="text-6">
<p>
Returns true if coll implements Associative
</p>
<div class="org-src-container">
<pre class="src src-clojure">(associative? (list)) <span style="color: #696969;">;=&gt; false</span>
(associative? (vector)) <span style="color: #696969;">;=&gt; true</span>
(associative? (hash-set)) <span style="color: #696969;">;=&gt; false</span>
(associative? (sorted-set)) <span style="color: #696969;">;=&gt; false</span>
(associative? (hash-map)) <span style="color: #696969;">;=&gt; true</span>
(associative? (sorted-map)) <span style="color: #696969;">;=&gt; true</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org5d44f8f" class="outline-2">
<h2 id="org5d44f8f"><span class="section-number-2">7.</span> type</h2>
<div class="outline-text-2" id="text-7">
<p>
Returns the :type metadata of x, or its Class if none
</p>
<div class="org-src-container">
<pre class="src src-clojure">(type (list)) <span style="color: #696969;">;=&gt; Persistentlist$EmptyList</span>
(type (vector)) <span style="color: #696969;">;=&gt; PersistentVector</span>
(type (hash-set)) <span style="color: #696969;">;=&gt; PersistentHashSet</span>
(type (sorted-set)) <span style="color: #696969;">;=&gt; PersistentTreeSet</span>
(type (hash-map)) <span style="color: #696969;">;=&gt; PersistentArrayMap</span>
(type (sorted-map)) <span style="color: #696969;">;=&gt; PersistentTreeMap</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org0110584" class="outline-2">
<h2 id="org0110584"><span class="section-number-2">8.</span> type data</h2>
<div class="outline-text-2" id="text-8">
<div class="org-src-container">
<pre class="src src-clojure">(type (list 1)) <span style="color: #696969;">;=&gt; Persistentlist</span>
(type (vector 1)) <span style="color: #696969;">;=&gt; PersistentVector</span>
(type (hash-set 1)) <span style="color: #696969;">;=&gt; PersistentHashSet</span>
(type (sorted-set 1)) <span style="color: #696969;">;=&gt; PersistentTreeSet</span>
(type (hash-map <span style="color: #d2a6ff;">:a</span> 1)) <span style="color: #696969;">;=&gt; PersistentHashMap</span>
(type (sorted-map <span style="color: #d2a6ff;">:a</span> 1)) <span style="color: #696969;">;=&gt; PersistentTreeMap</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org5eb3c4d" class="outline-2">
<h2 id="org5eb3c4d"><span class="section-number-2">9.</span> list?</h2>
<div class="outline-text-2" id="text-9">
<p>
Returns true if x implements IPersistentlist
</p>
<div class="org-src-container">
<pre class="src src-clojure">(list? (list)) <span style="color: #696969;">;=&gt; true</span>
(list? (vector)) <span style="color: #696969;">;=&gt; false</span>
(list? (hash-set)) <span style="color: #696969;">;=&gt; false</span>
(list? (sorted-set)) <span style="color: #696969;">;=&gt; false</span>
(list? (hash-map)) <span style="color: #696969;">;=&gt; false</span>
(list? (sorted-map)) <span style="color: #696969;">;=&gt; false</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfeaf198" class="outline-2">
<h2 id="orgfeaf198"><span class="section-number-2">10.</span> vector?</h2>
<div class="outline-text-2" id="text-10">
<p>
Return true if x implements IPersistentVector
</p>
<div class="org-src-container">
<pre class="src src-clojure">(vector? (list)) <span style="color: #696969;">;=&gt; false</span>
(vector? (vector)) <span style="color: #696969;">;=&gt; true</span>
(vector? (hash-set)) <span style="color: #696969;">;=&gt; false</span>
(vector? (sorted-set)) <span style="color: #696969;">;=&gt; false</span>
(vector? (hash-map)) <span style="color: #696969;">;=&gt; false</span>
(vector? (sorted-map)) <span style="color: #696969;">;=&gt; false</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgbd22e22" class="outline-2">
<h2 id="orgbd22e22"><span class="section-number-2">11.</span> set?</h2>
<div class="outline-text-2" id="text-11">
<div class="org-src-container">
<pre class="src src-clojure">(set? (list)) <span style="color: #696969;">;=&gt; false</span>
(set? (vector)) <span style="color: #696969;">;=&gt; false</span>
(set? (hash-set)) <span style="color: #696969;">;=&gt; true</span>
(set? (sorted-set)) <span style="color: #696969;">;=&gt; true</span>
(set? (hash-map)) <span style="color: #696969;">;=&gt; false</span>
(set? (sorted-map)) <span style="color: #696969;">;=&gt; false</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgdb63138" class="outline-2">
<h2 id="orgdb63138"><span class="section-number-2">12.</span> map?</h2>
<div class="outline-text-2" id="text-12">
<div class="org-src-container">
<pre class="src src-clojure">(map? (list)) <span style="color: #696969;">;=&gt; false</span>
(map? (vector)) <span style="color: #696969;">;=&gt; false</span>
(map? (hash-set)) <span style="color: #696969;">;=&gt; false</span>
(map? (sorted-set)) <span style="color: #696969;">;=&gt; false</span>
(map? (hash-map)) <span style="color: #696969;">;=&gt; true</span>
(map? (sorted-map)) <span style="color: #696969;">;=&gt; true</span>
</pre>
</div>
</div>
</div>
