clojure-collections-comparison.org
* (seq? (coll 1))
:PROPERTIES:
 :list: true
 :vector: false
 :HASH-SET: false
 :sorted-set: false
 :hash-map: false
 :sorted-map: false
:END:
Return true if x implements ISeq

#+begin_src clojure
  (seq? (list 1)) ;=> true
  (seq? (vector 1)) ;=> false
  (seq? (hash-set 1)) ;=> false
  (seq? (sorted-set 1)) ;=> false
  (seq? (hash-map :a 1)) ;=> false
  (seq? (sorted-map :a 1)) ;=> false
#+end_src
* (seq? (seq coll))
:PROPERTIES:
:list:     false
:vector:   false
:hash-set: false
:sorted-set: false
:hash-map: false
:sorted-map: false
:END:

#+begin_src clojure
  (seq? (seq (list))) ;=> false
  (seq? (seq (vector))) ;=> false
  (seq? (seq (hash-set))) ;=> false
  (seq? (seq (sorted-set))) ;=> false
  (seq? (seq (hash-map))) ;=> false
  (seq? (seq (sorted-map))) ;=> false
#+end_src
* (seq? (seq (coll 1))
:PROPERTIES:
:list:     true
:vector:   true
:hash-set: true
:sorted-set: true
:hash-map: true
:sorted-map: true
:END:

#+begin_src clojure
  (seq? (seq (list 1))) ;=> true
  (seq? (seq (vector 1))) ;=> true
  (seq? (seq (hash-set 1))) ;=> true
  (seq? (seq (sorted-set 1))) ;=> true
  (seq? (seq (hash-map :a 1))) ;=> true
  (seq? (seq (sorted-map :a 1))) ;=> true
#+end_src
* (type (seq coll))
:PROPERTIES:
 :list: nil
 :vector: nil
 :HASH-SET: nil
 :sorted-set: nil
 :hash-map: nil
 :sorted-map: nil
:END:
clojure.core/seq
([coll])

Returns a seq on the collection. If the collection is
empty, returns nil.  (seq nil) returns nil. seq also works on
Strings, native Java arrays (of reference types) and any objects
that implement Iterable. Note that seqs cache values, thus seq
should not be used on any Iterable whose iterator repeatedly
returns the same mutable object.

#+begin_src clojure
  (type (seq (list))) ;=> nil
  (type (seq (vector))) ;=> nil
  (type (seq (hash-set))) ;=> nil
  (type (seq (sorted-set))) ;=> nil
  (type (seq (hash-map))) ;=> nil
  (type (seq (sorted-map))) ;=> nil
#+end_src
* (type (sequence coll)
:PROPERTIES:
:list:     PersistentList$EmptyList
:VECTOR:   PersistentList$EmptyList
:hash-set: PersistentList$EmptyList
:sorted-set: PersistentList$EmptyList
:hash-map: PersistentList$EmptyList
:sorted-map: PersistentList$EmptyList
:END:
clojure.core/sequence
([coll] [xform coll] [xform coll & colls])
  Coerces coll to a (possibly empty) sequence, if it is not already
  one. Will not force a lazy seq. (sequence nil) yields (), When a
  transducer is supplied, returns a lazy sequence of applications of
  the transform to the items in coll(s), i.e. to the set of first
  items of each coll, followed by the set of second
  items in each coll, until any one of the colls is exhausted.  Any
  remaining items in other colls are ignored. The transform should accept
  number-of-colls arguments

#+begin_src clojure
  (type (sequence (list))) ;=> PersistentList$Emptylist
  (type (sequence (vector))) ;=> PersistentList$Emptylist
  (type (sequence (hash-set))) ;=> PersistentList$Emptylist
  (type (sequence (sorted-set))) ;=> PersistentList$Emptylist
  (type (sequence (hash-map))) ;=> PersistentList$Emptylist
  (type (sequence (sorted-map))) ;=> PersistentList$Emptylist
#+end_src
* (type (sequence (coll 1)))
:PROPERTIES:
 :list:     PersistentList
 :vector: PersistentVector$ChunkedSeq
 :HASH-SET: APersistentMap$KeySeq
 :sorted-set: APersistentMap$KeySeq
 :hash-map: PersistentHashMap$NodeSeq
 :sorted-map: PersistentTreeMap$Seq
:END:
clojure.core/sequence
([coll] [xform coll] [xform coll & colls])
  Coerces coll to a (possibly empty) sequence, if it is not already
  one. Will not force a lazy seq. (sequence nil) yields (), When a
  transducer is supplied, returns a lazy sequence of applications of
  the transform to the items in coll(s), i.e. to the set of first
  items of each coll, followed by the set of second
  items in each coll, until any one of the colls is exhausted.  Any
  remaining items in other colls are ignored. The transform should accept
  number-of-colls arguments

#+begin_src clojure
  (type (sequence (list 1))) ;=> PersistentList
  (type (sequence (vector 1))) ;=> PersistentVector$ChunkedSequence
  (type (sequence (hash-set 1))) ;=> APersistentMap$KeySequence
  (type (sequence (sorted-set 1))) ;=> APersistentMap$KeySequence
  (type (sequence (hash-map :a 1))) ;=> PersistentHashMap$NodeSequence
  (type (sequence (sorted-map :a 1))) ;=> PersistentTreeMap$Sequence
#+end_src
       
* (type (seq (coll 1)))
:PROPERTIES:
 :list:     PersistentList
 :vector: PersistentVector$ChunkedSeq
 :HASH-SET: APersistentMap$KeySeq
 :sorted-set: APersistentMap$KeySeq
 :hash-map: PersistentHashMap$NodeSeq
 :sorted-map: PersistentTreeMap$Seq
:END:
clojure.core/seq
([coll])

Returns a seq on the collection. If the collection is
empty, returns nil.  (seq nil) returns nil. seq also works on
Strings, native Java arrays (of reference types) and any objects
that implement Iterable. Note that seqs cache values, thus seq
should not be used on any Iterable whose iterator repeatedly
returns the same mutable object.

#+begin_src clojure
  (type (seq (list 1))) ;=> Persistentlist
  (type (seq (vector 1))) ;=> PersistentVector$ChunkedSeq
  (type (seq (hash-set 1))) ;=> APersistentMap$KeySeq
  (type (seq (sorted-set 1))) ;=> APersistentMap$KeySeq
  (type (seq (hash-map :a 1))) ;=> PersistentHashMap$NodeSeq
  (type (seq (sorted-map :a 1))) ;=> PersistentTreeMap$Seq
#+end_src
* "unique elements"
:PROPERTIES:
 :list: false
 :vector: false
 :HASH-SET: true
 :sorted-set: true
 :HASH-MAP: true (only keys)
 :SORTED-MAP: true (only keys)
:END:  
* "same order of elements"
:PROPERTIES:
 :list: true
 :vector: true
 :HASH-SET: false
 :sorted-set: true
 :hash-map: false
 :sorted-map: true
:END:  
* "read"
:PROPERTIES:
 :list: nth
 :VECTOR:   get, IFn, nth
 :HASH-SET:
 :sorted-set:
 :HASH-MAP: get, IFn, key
 :SORTED-MAP: get, IFn, key
:END:

You cannot use the get function with a list to retrieve by index.
* (get coll 1)
:PROPERTIES:
:list:     nil
:VECTOR:   nil
:sorted-set: nil
:hash-map: nil
:sorted-map: nil
:hash-set: nil
:END:
([map key] [map key not-found])

#+begin_src clojure
  (get (list) 1) ;=> nil
  (get (vector) 1) ;=> nil
  (get (hash-set) 1) ;=> nil
  (get (sorted-set) 1) ;=> nil
  (get (hash-map) :a) ;=> nil
  (get (sorted-map) :a) ;=> nil
#+end_src
