index.html
<div id="outline-container-orgcdfc7a7" class="outline-2">
<h2 id="orgcdfc7a7"><span class="section-number-2">13.</span> seq?</h2>
<div class="outline-text-2" id="text-13">
<p>
Return true if x implements ISeq
</p>

<div class="org-src-container">
<pre class="src src-clojure">(seq? (list)) <span style="color: #696969;">;=&gt; true</span>
(seq? (vector)) <span style="color: #696969;">;=&gt; false</span>
(seq? (hash-set)) <span style="color: #696969;">;=&gt; false</span>
(seq? (sorted-set)) <span style="color: #696969;">;=&gt; false</span>
(seq? (hash-map)) <span style="color: #696969;">;=&gt; false</span>
(seq? (sorted-map)) <span style="color: #696969;">;=&gt; false</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org50fa72c" class="outline-2">
<h2 id="org50fa72c"><span class="section-number-2">14.</span> seq? data</h2>
<div class="outline-text-2" id="text-14">
<p>
Return true if x implements ISeq
</p>

<div class="org-src-container">
<pre class="src src-clojure">(seq? (list 1)) <span style="color: #696969;">;=&gt; true</span>
(seq? (vector 1)) <span style="color: #696969;">;=&gt; false</span>
(seq? (hash-set 1)) <span style="color: #696969;">;=&gt; false</span>
(seq? (sorted-set 1)) <span style="color: #696969;">;=&gt; false</span>
(seq? (hash-map <span style="color: #d2a6ff;">:a</span> 1)) <span style="color: #696969;">;=&gt; false</span>
(seq? (sorted-map <span style="color: #d2a6ff;">:a</span> 1)) <span style="color: #696969;">;=&gt; false</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orge7448ce" class="outline-2">
<h2 id="orge7448ce"><span class="section-number-2">15.</span> seq? seq</h2>
<div class="outline-text-2" id="text-15">
<div class="org-src-container">
<pre class="src src-clojure">(seq? (seq (list))) <span style="color: #696969;">;=&gt; false</span>
(seq? (seq (vector))) <span style="color: #696969;">;=&gt; false</span>
(seq? (seq (hash-set))) <span style="color: #696969;">;=&gt; false</span>
(seq? (seq (sorted-set))) <span style="color: #696969;">;=&gt; false</span>
(seq? (seq (hash-map))) <span style="color: #696969;">;=&gt; false</span>
(seq? (seq (sorted-map))) <span style="color: #696969;">;=&gt; false</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb59bb69" class="outline-2">
<h2 id="orgb59bb69"><span class="section-number-2">16.</span> seq? seq data</h2>
<div class="outline-text-2" id="text-16">
<div class="org-src-container">
<pre class="src src-clojure">(seq? (seq (list 1))) <span style="color: #696969;">;=&gt; true</span>
(seq? (seq (vector 1))) <span style="color: #696969;">;=&gt; true</span>
(seq? (seq (hash-set 1))) <span style="color: #696969;">;=&gt; true</span>
(seq? (seq (sorted-set 1))) <span style="color: #696969;">;=&gt; true</span>
(seq? (seq (hash-map <span style="color: #d2a6ff;">:a</span> 1))) <span style="color: #696969;">;=&gt; true</span>
(seq? (seq (sorted-map <span style="color: #d2a6ff;">:a</span> 1))) <span style="color: #696969;">;=&gt; true</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb94afdb" class="outline-2">
<h2 id="orgb94afdb"><span class="section-number-2">17.</span> type seq</h2>
<div class="outline-text-2" id="text-17">
<p>
clojure.core/seq
([coll])
</p>

<p>
Returns a seq on the collection. If the collection is
empty, returns nil.  (seq nil) returns nil. seq also works on
Strings, native Java arrays (of reference types) and any objects
that implement Iterable. Note that seqs cache values, thus seq
should not be used on any Iterable whose iterator repeatedly
returns the same mutable object.
</p>

<div class="org-src-container">
<pre class="src src-clojure">(seq (list)) <span style="color: #696969;">;=&gt; nil</span>
(seq (vector)) <span style="color: #696969;">;=&gt; nil</span>
(seq (hash-set)) <span style="color: #696969;">;=&gt; nil</span>
(seq (sorted-set)) <span style="color: #696969;">;=&gt; nil</span>
(seq (hash-map)) <span style="color: #696969;">;=&gt; nil</span>
(seq (sorted-map)) <span style="color: #696969;">;=&gt; nil</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org2126b16" class="outline-2">
<h2 id="org2126b16"><span class="section-number-2">18.</span> type sequence</h2>
<div class="outline-text-2" id="text-18">
<p>
clojure.core/sequence
([coll] [xform coll] [xform coll &amp; colls])
  Coerces coll to a (possibly empty) sequence, if it is not already
  one. Will not force a lazy seq. (sequence nil) yields (), When a
  transducer is supplied, returns a lazy sequence of applications of
  the transform to the items in coll(s), i.e. to the set of first
  items of each coll, followed by the set of second
  items in each coll, until any one of the colls is exhausted.  Any
  remaining items in other colls are ignored. The transform should accept
  number-of-colls arguments
</p>

<div class="org-src-container">
<pre class="src src-clojure">(type (sequence (list))) <span style="color: #696969;">;=&gt; PersistentList$Emptylist</span>
(type (sequence (vector))) <span style="color: #696969;">;=&gt; PersistentList$Emptylist</span>
(type (sequence (hash-set))) <span style="color: #696969;">;=&gt; PersistentList$Emptylist</span>
(type (sequence (sorted-set))) <span style="color: #696969;">;=&gt; PersistentList$Emptylist</span>
(type (sequence (hash-map))) <span style="color: #696969;">;=&gt; PersistentList$Emptylist</span>
(type (sequence (sorted-map))) <span style="color: #696969;">;=&gt; PersistentList$Emptylist</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org253a97d" class="outline-2">
<h2 id="org253a97d"><span class="section-number-2">19.</span> type seq data</h2>
<div class="outline-text-2" id="text-19">
<p>
clojure.core/seq
([coll])
</p>

<p>
Returns a seq on the collection. If the collection is
empty, returns nil.  (seq nil) returns nil. seq also works on
Strings, native Java arrays (of reference types) and any objects
that implement Iterable. Note that seqs cache values, thus seq
should not be used on any Iterable whose iterator repeatedly
returns the same mutable object.
</p>

<div class="org-src-container">
<pre class="src src-clojure">(type (seq (list 1))) <span style="color: #696969;">;=&gt; Persistentlist</span>
(type (seq (vector 1))) <span style="color: #696969;">;=&gt; PersistentVector$ChunkedSeq</span>
(type (seq (hash-set 1))) <span style="color: #696969;">;=&gt; APersistentMap$KeySeq</span>
(type (seq (sorted-set 1))) <span style="color: #696969;">;=&gt; APersistentMap$KeySeq</span>
(type (seq (hash-map <span style="color: #d2a6ff;">:a</span> 1))) <span style="color: #696969;">;=&gt; PersistentHashMap$NodeSeq</span>
(type (seq (sorted-map <span style="color: #d2a6ff;">:a</span> 1))) <span style="color: #696969;">;=&gt; PersistentTreeMap$Seq</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgefa8a81" class="outline-2">
<h2 id="orgefa8a81"><span class="section-number-2">20.</span> type sequence data</h2>
<div class="outline-text-2" id="text-20">
<p>
clojure.core/sequence
([coll] [xform coll] [xform coll &amp; colls])
  Coerces coll to a (possibly empty) sequence, if it is not already
  one. Will not force a lazy seq. (sequence nil) yields (), When a
  transducer is supplied, returns a lazy sequence of applications of
  the transform to the items in coll(s), i.e. to the set of first
  items of each coll, followed by the set of second
  items in each coll, until any one of the colls is exhausted.  Any
  remaining items in other colls are ignored. The transform should accept
  number-of-colls arguments
</p>

<div class="org-src-container">
<pre class="src src-clojure">(type (sequence (list 1))) <span style="color: #696969;">;=&gt; PersistentList</span>
(type (sequence (vector 1))) <span style="color: #696969;">;=&gt; PersistentVector$ChunkedSequence</span>
(type (sequence (hash-set 1))) <span style="color: #696969;">;=&gt; APersistentMap$KeySequence</span>
(type (sequence (sorted-set 1))) <span style="color: #696969;">;=&gt; APersistentMap$KeySequence</span>
(type (sequence (hash-map <span style="color: #d2a6ff;">:a</span> 1))) <span style="color: #696969;">;=&gt; PersistentHashMap$NodeSequence</span>
(type (sequence (sorted-map <span style="color: #d2a6ff;">:a</span> 1))) <span style="color: #696969;">;=&gt; PersistentTreeMap$Sequence</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org08c6a71" class="outline-2">
<h2 id="org08c6a71"><span class="section-number-2">21.</span> "unique elements"</h2>
<div class="outline-text-2" id="text-21">
</div>
</div>
<div id="outline-container-orgebc7f3a" class="outline-2">
<h2 id="orgebc7f3a"><span class="section-number-2">22.</span> "same order of elements"</h2>
<div class="outline-text-2" id="text-22">
</div>
</div>
<div id="outline-container-org11c11da" class="outline-2">
<h2 id="org11c11da"><span class="section-number-2">23.</span> "read"</h2>
<div class="outline-text-2" id="text-23">
<p>
You cannot use the get function with a list to retrieve by index.
</p>
</div>
</div>
<div id="outline-container-orgad8a8fa" class="outline-2">
<h2 id="orgad8a8fa"><span class="section-number-2">24.</span> get</h2>
<div class="outline-text-2" id="text-24">
<p>
([map key] [map key not-found])
</p>

<div class="org-src-container">
<pre class="src src-clojure">(get (list) 0) <span style="color: #696969;">;=&gt; nil</span>
(get (vector) 0) <span style="color: #696969;">;=&gt; nil</span>
(get (hash-set) 0) <span style="color: #696969;">;=&gt; nil</span>
(get (sorted-set) 0) <span style="color: #696969;">;=&gt; nil</span>
(get (hash-map) <span style="color: #d2a6ff;">:a</span>) <span style="color: #696969;">;=&gt; nil</span>
(get (sorted-map) <span style="color: #d2a6ff;">:a</span>) <span style="color: #696969;">;=&gt; nil</span>
</pre>
</div>
</div>
</div>
