clojure-collections-comparison.org
* (get (coll 1) 1)
:PROPERTIES:
:list:     nil
:VECTOR:   true (index)
:sorted-set: useless
:HASH-MAP: true (key)
:SORTED-MAP: true (key)
:hash-set: useless
:END:
([map key] [map key not-found])

#+begin_src clojure
  (get (list :a :b) 0) ;=> nil
  (get (list :a :b) :a) ;=> nil
  (get (list :a :b) "string") ;=> nil
 ; Although lists are sequences, they are not keyed sequences.

  (get (vector :a :b) 0) ;=> :a
  (get (vector :a :b) 1) ;=> :b

  (get (hash-set :a :b) 0) ;=> nil
  (get (hash-set :a :b) 1) ;=> nil
  (get (hash-set :a :b) :a) ;=> :a
  (get (hash-set :a :b) "string") ;=> nil

  (get (sorted-set :a :b) 0) ;=> Unhandled java.lang.ClassCastException
  (get (sorted-set :a :b) 1) ;=> Unhandled java.lang.ClassCastException
  (get (sorted-set :a :b) "string") ;=> Unhandled java.lang.ClassCastException
  (get (sorted-set :a :b) :a) ;=> :a
  (get (sorted-set :a :b) :b) ;=> :a

  (get (hash-map :a 1 :b 2) :a) ;=> 1
  (get (hash-map :a 1 :b 2) 1) ;=> nil
  (get (sorted-map :a 1 :b 2) :a) ;=> 1
  (get (sorted-map :a 1 :b 2) 1) ;=> ;=> Unhandled java.lang.ClassCastException
#+end_src
* (get nil 1)
:PROPERTIES:
:list:     nil
:VECTOR:   nil
:sorted-set: nil
:hash-map: nil
:sorted-map: nil
:hash-set: nil
:END:

#+begin_src clojure
(get nil 1) ; => nil
#+end_src
* "get out of range"
:PROPERTIES:
:LIST:     nil or not-found
:VECTOR:   nil or not-found
:HASH-SET: nil or not-found
:SORTED-SET: nil or not-found
:HASH-MAP: nil or not-found
:SORTED-MAP: nil or not-found
:END:  
* "IFn"
:PROPERTIES:
 :list: error
 :VECTOR:   ([:a :b :c] 1) => :b
 :hash-set: error
 :sorted-set: error
 :hash-map: ({:b 2 :c 3 :a 1} :b) => 2
 :sorted-map: ({:a 1 :b 2 :c 3} :a) => 1
:END:

#+begin_src clojure
('(1 2 3) 1) ; class clojure.lang.PersistentList cannot be cast to class clojure.lang.IFn (clojure.lang.PersistentList and clojure.lang.IFn

([1 2 3] 1) ;=> 2

(#(1 2 3) 2) ;=> error
#+end_src

'IFn' means 'Interface Function'.
Keywords also have this interface. In the preceding examples, we can see that a list that is not quoted with ' throws an
error unless the first item of the list can be invoked as a function.

#+begin_src clojure
  ({:a 1 :b 2 :c 3} :a); => 1 | maps are functions of their keys
  (:a {:a 1 :b 2 :c 3}) ; => 1 | keywords are also functions

  (1 [:b :c :a]) ;=> error
  ([:b :c :a] 1) ;=> :c
  (:c [:b :c :a]) ;=> nil

  (nil 0) ; => IllegalArgumentException
#+end_src
* "IFn out of range"
:PROPERTIES:
:LIST:     error
:VECTOR:   error
:HASH-SET: error
:SORTED-SET: error
:SORTED-MAP: nil
:HASH-MAP: nil
:END:

#+begin_src clojure
  ([:a :b] 2) ;=> IndexOutOfBoundsException
  ({:a 1 :b 2} :c); => nil
#+end_src
       
* "nth"
:PROPERTIES:
:list:     true
:VECTOR:   true
:SORTED-SET: true
:HASH-MAP: error
:SORTED-MAP: error
:HASH-SET: true
:END:
([coll index] [coll index not-found]) throws an exception unless not-found is supplied

Using nth to retrieve an element from a list is slower than using get to retrieve an element from a vector.
#+begin_src clojure
  (nth (list :a :b) 0) ;=> :a
  (nth (list :a :b) 1) ;=> :b
  (nth (list :a :b) 3) ;=> Unhandled java.lang.IndexOutOfBoundsException

  (nth (vector :a :b) 0) ;=> :a
  (nth (vector :a :b) 1) ;=> :b

  (nth (hash-set :a :b) 0) ;=> Unhandled java.lang.UnsupportedOperationException

  (nth (sorted-set :a :b) 0) ;=> Unhandled java.lang.UnsupportedOperationException

  (nth (hash-map :a 1 :b 2) 0) ;=> Unhandled java.lang.UnsupportedOperationException
#+end_src
* (nth nil 1)
:PROPERTIES:
:LIST:
:VECTOR:   nil
:END:

#+begin_src clojure
(nth nil 1) ; => nil
#+end_src
* "nth out of range"
:PROPERTIES:
:list:
:VECTOR:   
:SORTED-SET:
:HASH-MAP:
:SORTED-MAP:
:HASH-SET:
:END:

#+begin_src clojure

#+end_src
* "add"
:PROPERTIES:
:list:     cons, conj
:vector:
 :HASH-SET:
 :sorted-set:
 :hash-map: assoc
 :sorted-map: assoc
:END:  
* "conj (coll)"
:PROPERTIES:
 :list: front
 :vector: back
 :hash-set: vary
 :sorted-set: vary
 :hash-map: vary
 :sorted-map: vary
:END:

#+begin_src clojure
(conj [1 2 3] 4) ; => [1 2 3 4]
#+end_src
       
* "cons (seq)"
:PROPERTIES:
 :list: front
 :vector: front
 :hash-set: vary
 :sorted-set: vary
 :hash-map: vary
 :sorted-map: vary
:END:

#+begin_src clojure
  (cons "two" (list "first")) ;=> ("two" "first")
  (cons "two" (vector "first"))  ;=> ("two" "first")
  (cons "two" (hash-set "first"))  ;=> ("two" "first")
  (cons "two" (sorted-set "first"))  ;=> ("two" "first")
#+end_src
       
* "remove"
:PROPERTIES:
 :list:
 :vector: disj
 :hash-set:
 :sorted-set:
 :hash-map: dissoc
 :sorted-map:
:END:  
