index.html
<div id="outline-container-orgbbd729a" class="outline-2">
<h2 id="orgbbd729a"><span class="section-number-2">25.</span> get data</h2>
<div class="outline-text-2" id="text-25">
<p>
([map key] [map key not-found])
</p>

<div class="org-src-container">
<pre class="src src-clojure"> (get (list <span style="color: #d2a6ff;">:a</span> <span style="color: #d2a6ff;">:b</span>) 0) <span style="color: #696969;">;=&gt; nil</span>
 (get (list <span style="color: #d2a6ff;">:a</span> <span style="color: #d2a6ff;">:b</span>) <span style="color: #d2a6ff;">:a</span>) <span style="color: #696969;">;=&gt; nil</span>
 (get (list <span style="color: #d2a6ff;">:a</span> <span style="color: #d2a6ff;">:b</span>) <span style="color: #6C8A56;">"string"</span>) <span style="color: #696969;">;=&gt; nil</span>
<span style="color: #696969;">; </span><span style="color: #696969;">Although lists are sequences, they are not keyed sequences.</span>

 (get (vector <span style="color: #d2a6ff;">:a</span> <span style="color: #d2a6ff;">:b</span>) 0) <span style="color: #696969;">;=&gt; :a</span>
 (get (vector <span style="color: #d2a6ff;">:a</span> <span style="color: #d2a6ff;">:b</span>) 1) <span style="color: #696969;">;=&gt; :b</span>

 (get (hash-set <span style="color: #d2a6ff;">:a</span> <span style="color: #d2a6ff;">:b</span>) 0) <span style="color: #696969;">;=&gt; nil</span>
 (get (hash-set <span style="color: #d2a6ff;">:a</span> <span style="color: #d2a6ff;">:b</span>) 1) <span style="color: #696969;">;=&gt; nil</span>
 (get (hash-set <span style="color: #d2a6ff;">:a</span> <span style="color: #d2a6ff;">:b</span>) <span style="color: #d2a6ff;">:a</span>) <span style="color: #696969;">;=&gt; :a</span>
 (get (hash-set <span style="color: #d2a6ff;">:a</span> <span style="color: #d2a6ff;">:b</span>) <span style="color: #6C8A56;">"string"</span>) <span style="color: #696969;">;=&gt; nil</span>

 (get (sorted-set <span style="color: #d2a6ff;">:a</span> <span style="color: #d2a6ff;">:b</span>) 0) <span style="color: #696969;">;=&gt; Unhandled java.lang.ClassCastException</span>
 (get (sorted-set <span style="color: #d2a6ff;">:a</span> <span style="color: #d2a6ff;">:b</span>) 1) <span style="color: #696969;">;=&gt; Unhandled java.lang.ClassCastException</span>
 (get (sorted-set <span style="color: #d2a6ff;">:a</span> <span style="color: #d2a6ff;">:b</span>) <span style="color: #6C8A56;">"string"</span>) <span style="color: #696969;">;=&gt; Unhandled java.lang.ClassCastException</span>
 (get (sorted-set <span style="color: #d2a6ff;">:a</span> <span style="color: #d2a6ff;">:b</span>) <span style="color: #d2a6ff;">:a</span>) <span style="color: #696969;">;=&gt; :a</span>
 (get (sorted-set <span style="color: #d2a6ff;">:a</span> <span style="color: #d2a6ff;">:b</span>) <span style="color: #d2a6ff;">:b</span>) <span style="color: #696969;">;=&gt; :a</span>

 (get (hash-map <span style="color: #d2a6ff;">:a</span> 1 <span style="color: #d2a6ff;">:b</span> 2) <span style="color: #d2a6ff;">:a</span>) <span style="color: #696969;">;=&gt; 1</span>
 (get (hash-map <span style="color: #d2a6ff;">:a</span> 1 <span style="color: #d2a6ff;">:b</span> 2) 1) <span style="color: #696969;">;=&gt; nil</span>
 (get (sorted-map <span style="color: #d2a6ff;">:a</span> 1 <span style="color: #d2a6ff;">:b</span> 2) <span style="color: #d2a6ff;">:a</span>) <span style="color: #696969;">;=&gt; 1</span>
 (get (sorted-map <span style="color: #d2a6ff;">:a</span> 1 <span style="color: #d2a6ff;">:b</span> 2) 1) <span style="color: #696969;">;=&gt; ;=&gt; Unhandled java.lang.ClassCastException</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org291d5ce" class="outline-2">
<h2 id="org291d5ce"><span class="section-number-2">26.</span> get nil</h2>
<div class="outline-text-2" id="text-26">
<div class="org-src-container">
<pre class="src src-clojure">(get <span style="color: #d2a6ff;">nil</span> 0) <span style="color: #696969;">; =&gt; nil</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orge0ee23f" class="outline-2">
<h2 id="orge0ee23f"><span class="section-number-2">27.</span> get out of range</h2>
<div class="outline-text-2" id="text-27">
</div>
</div>
<div id="outline-container-org97f1120" class="outline-2">
<h2 id="org97f1120"><span class="section-number-2">28.</span> IFn</h2>
<div class="outline-text-2" id="text-28">
<div class="org-src-container">
<pre class="src src-clojure">('(1 2 3) 1) <span style="color: #696969;">; class clojure.lang.PersistentList cannot be cast to class clojure.lang.IFn (clojure.lang.PersistentList and clojure.lang.IFn</span>

([1 2 3] 1) <span style="color: #696969;">;=&gt; 2</span>

(#(1 2 3) 2) <span style="color: #696969;">;=&gt; error</span>
</pre>
</div>

<p>
'IFn' means 'Interface Function'.
Keywords also have this interface. In the preceding examples, we can see that a list that is not quoted with ' throws an
error unless the first item of the list can be invoked as a function.
</p>

<div class="org-src-container">
<pre class="src src-clojure">({<span style="color: #d2a6ff;">:a</span> 1 <span style="color: #d2a6ff;">:b</span> 2 <span style="color: #d2a6ff;">:c</span> 3} <span style="color: #d2a6ff;">:a</span>)<span style="color: #696969;">; =&gt; 1 | maps are functions of their keys</span>
(<span style="color: #d2a6ff;">:a</span> {<span style="color: #d2a6ff;">:a</span> 1 <span style="color: #d2a6ff;">:b</span> 2 <span style="color: #d2a6ff;">:c</span> 3}) <span style="color: #696969;">; =&gt; 1 | keywords are also functions</span>

(1 [<span style="color: #d2a6ff;">:b</span> <span style="color: #d2a6ff;">:c</span> <span style="color: #d2a6ff;">:a</span>]) <span style="color: #696969;">;=&gt; error</span>
([<span style="color: #d2a6ff;">:b</span> <span style="color: #d2a6ff;">:c</span> <span style="color: #d2a6ff;">:a</span>] 1) <span style="color: #696969;">;=&gt; :c</span>
(<span style="color: #d2a6ff;">:c</span> [<span style="color: #d2a6ff;">:b</span> <span style="color: #d2a6ff;">:c</span> <span style="color: #d2a6ff;">:a</span>]) <span style="color: #696969;">;=&gt; nil</span>

(<span style="color: #d2a6ff;">nil</span> 0) <span style="color: #696969;">; =&gt; IllegalArgumentException</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb1f6d54" class="outline-2">
<h2 id="orgb1f6d54"><span class="section-number-2">29.</span> IFn out of range</h2>
<div class="outline-text-2" id="text-29">
<div class="org-src-container">
<pre class="src src-clojure">([<span style="color: #d2a6ff;">:a</span> <span style="color: #d2a6ff;">:b</span>] 2) <span style="color: #696969;">;=&gt; IndexOutOfBoundsException</span>
({<span style="color: #d2a6ff;">:a</span> 1 <span style="color: #d2a6ff;">:b</span> 2} <span style="color: #d2a6ff;">:c</span>)<span style="color: #696969;">; =&gt; nil</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd7de2b1" class="outline-2">
<h2 id="orgd7de2b1"><span class="section-number-2">30.</span> nth</h2>
<div class="outline-text-2" id="text-30">
<p>
([coll index] [coll index not-found]) throws an exception unless not-found is supplied
</p>

<p>
Using nth to retrieve an element from a list is slower than using get to retrieve an element from a vector.
</p>
<div class="org-src-container">
<pre class="src src-clojure">(nth (list <span style="color: #d2a6ff;">:a</span> <span style="color: #d2a6ff;">:b</span>) 0) <span style="color: #696969;">;=&gt; :a</span>
(nth (list <span style="color: #d2a6ff;">:a</span> <span style="color: #d2a6ff;">:b</span>) 1) <span style="color: #696969;">;=&gt; :b</span>
(nth (list <span style="color: #d2a6ff;">:a</span> <span style="color: #d2a6ff;">:b</span>) 3) <span style="color: #696969;">;=&gt; Unhandled java.lang.IndexOutOfBoundsException</span>

(nth (vector <span style="color: #d2a6ff;">:a</span> <span style="color: #d2a6ff;">:b</span>) 0) <span style="color: #696969;">;=&gt; :a</span>
(nth (vector <span style="color: #d2a6ff;">:a</span> <span style="color: #d2a6ff;">:b</span>) 1) <span style="color: #696969;">;=&gt; :b</span>

(nth (hash-set <span style="color: #d2a6ff;">:a</span> <span style="color: #d2a6ff;">:b</span>) 0) <span style="color: #696969;">;=&gt; Unhandled java.lang.UnsupportedOperationException</span>

(nth (sorted-set <span style="color: #d2a6ff;">:a</span> <span style="color: #d2a6ff;">:b</span>) 0) <span style="color: #696969;">;=&gt; Unhandled java.lang.UnsupportedOperationException</span>

(nth (hash-map <span style="color: #d2a6ff;">:a</span> 1 <span style="color: #d2a6ff;">:b</span> 2) 0) <span style="color: #696969;">;=&gt; Unhandled java.lang.UnsupportedOperationException</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org4cf98b8" class="outline-2">
<h2 id="org4cf98b8"><span class="section-number-2">31.</span> nth nil</h2>
<div class="outline-text-2" id="text-31">
<div class="org-src-container">
<pre class="src src-clojure">(nth <span style="color: #d2a6ff;">nil</span> 0) <span style="color: #696969;">; =&gt; nil</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc83b771" class="outline-2">
<h2 id="orgc83b771"><span class="section-number-2">32.</span> nth out of range</h2>
<div class="outline-text-2" id="text-32">
<div class="org-src-container">
<pre class="src src-clojure">
</pre>
</div>
</div>
</div>
<div id="outline-container-org2d623a5" class="outline-2">
<h2 id="org2d623a5"><span class="section-number-2">33.</span> "add"</h2>
<div class="outline-text-2" id="text-33">
</div>
</div>
<div id="outline-container-org34250a5" class="outline-2">
<h2 id="org34250a5"><span class="section-number-2">34.</span> conj (coll)</h2>
<div class="outline-text-2" id="text-34">
<div class="org-src-container">
<pre class="src src-clojure">(conj [1 2 3] 4) <span style="color: #696969;">; =&gt; [1 2 3 4]</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org40420a4" class="outline-2">
<h2 id="org40420a4"><span class="section-number-2">35.</span> cons (seq)</h2>
<div class="outline-text-2" id="text-35">
<div class="org-src-container">
<pre class="src src-clojure">(cons <span style="color: #6C8A56;">"two"</span> (list <span style="color: #6C8A56;">"first"</span>)) <span style="color: #696969;">;=&gt; ("two" "first")</span>
(cons <span style="color: #6C8A56;">"two"</span> (vector <span style="color: #6C8A56;">"first"</span>))  <span style="color: #696969;">;=&gt; ("two" "first")</span>
(cons <span style="color: #6C8A56;">"two"</span> (hash-set <span style="color: #6C8A56;">"first"</span>))  <span style="color: #696969;">;=&gt; ("two" "first")</span>
(cons <span style="color: #6C8A56;">"two"</span> (sorted-set <span style="color: #6C8A56;">"first"</span>))  <span style="color: #696969;">;=&gt; ("two" "first")</span>
</pre>
</div>
</div>
</div>
